[
  {
    "type": "human",
    "content": "olá"
  },
  {
    "type": "ai",
    "content": "Olá! É um prazer conversar com você. Estou aqui para ajudá-lo a explorar novas oportunidades de desenvolvimento profissional e descobrir possibilidades que podem melhorar sua vida e carreira.\n\nPara começar, gostaria de saber um pouco mais sobre você. Qual é o seu nível de escolaridade atual? Você tem um diploma de graduação, pós-graduação ou está cursando alguma coisa no momento?"
  },
  {
    "type": "human",
    "content": "eu tenho o ensino médio completo"
  },
  {
    "type": "ai",
    "content": "O ensino médio completo é um bom ponto de partida. Agora, gostaria de saber um pouco mais sobre sua experiência profissional atual. Você está trabalhando atualmente? Se sim, em que área ou setor você atua? E como você se sente em relação ao seu trabalho atual? Você está satisfeito com o que faz ou está procurando por algo novo?\n\n(Lembre-se, essa conversa é para ajudá-lo a explorar novas oportunidades, então sinta-se à vontade para compartilhar seus pensamentos e sentimentos!)"
  },
  {
    "type": "human",
    "content": "eu trabalho como pedreiro atualmente, mas isso me cansa demais e paga muito pouco"
  },
  {
    "type": "ai",
    "content": "Entendo. Trabalhar como pedreiro pode ser fisicamente exigente e, às vezes, não é bem remunerado. É compreensível que você esteja procurando por algo que seja menos cansativo e mais gratificante financeiramente.\n\nAgora, gostaria de saber se você tem algum objetivo profissional em mente. Você tem alguma ideia de que tipo de trabalho ou setor gostaria de trabalhar no futuro? Ou está aberto a considerar novas áreas ou funções?\n\n(Lembre-se, não precisa ter uma resposta certa ou errada. Estamos apenas explorando possibilidades!)"
  },
  {
    "type": "human",
    "content": "não sei, você tem alguma sugestão?"
  },
  {
    "type": "ai",
    "content": "Não quero sugerir nada específico ainda, pois quero entender melhor suas preferências e interesses. Mas posso dizer que há muitas áreas que podem ser menos fisicamente exigentes e mais gratificantes financeiramente.\n\nPor exemplo, você poderia considerar áreas como tecnologia, serviços, ou até mesmo cursos de formação profissional que possam te ajudar a desenvolver habilidades novas.\n\nMas, antes de mais nada, gostaria de saber: você tem algum interesse ou paixão por alguma área específica? Você gosta de trabalhar com pessoas, máquinas, ou talvez criar coisas?\n\nE, se você tivesse a oportunidade de fazer um curso ou treinamento, o que você gostaria de aprender?\n\n(Lembre-se, estamos apenas explorando possibilidades!)"
  },
  {
    "type": "human",
    "content": "acho que eu gostaria de ser engenheiro civil"
  },
  {
    "type": "ai",
    "content": "Engenheiro civil é uma carreira muito respeitada e pode ser muito gratificante. Como pedreiro, você já tem uma boa base em construção e pode ter uma vantagem em relação a outros que estão começando do zero.\n\nNo entanto, para se tornar um engenheiro civil, você precisará de uma formação acadêmica mais avançada. Você estaria disposto a investir tempo e esforço em um curso de graduação em engenharia civil?\n\nAlém disso, gostaria de saber: você prefere cursos presenciais ou virtuais? Você tem uma preferência por aprender em uma sala de aula tradicional ou gostaria de ter a flexibilidade de aprender online?\n\nE, em termos de tempo e recursos, você tem alguma limitação que possa afetar sua capacidade de se dedicar a um curso ou treinamento? Por exemplo, você tem horários fixos de trabalho ou responsabilidades familiares que precisam ser consideradas?"
  },
  {
    "type": "human",
    "content": "eu trabalho de manhã e de tarde, tenho tempo para fazer o curso a noite, mas não tenho muitos recursos para bancar uma faculdade como essa"
  },
  {
    "type": "ai",
    "content": "Entendo. É ótimo que você tenha tempo disponível à noite para fazer um curso. No entanto, é compreensível que você tenha preocupações financeiras.\n\nHá algumas opções que você pode considerar para acessar um curso de engenharia civil sem gastar muito dinheiro. Por exemplo, você pode procurar por cursos online gratuitos ou de baixo custo, ou até mesmo por bolsas de estudo ou financiamento para estudantes.\n\nAlém disso, há também opções de cursos técnicos em construção civil que podem ser mais acessíveis do que um curso de graduação em engenharia civil. Esses cursos podem ser uma boa opção para você começar a desenvolver habilidades e conhecimentos na área.\n\nOutra opção é procurar por instituições de ensino que ofereçam cursos de engenharia civil com financiamento ou bolsas de estudo. Muitas instituições oferecem essas opções para estudantes que não têm recursos financeiros suficientes.\n\nVou analisar as opções que se encaixam no seu perfil e ver o que posso encontrar para você.\n\nObrigado pelas informações, vou analisar as oportunidades que se encaixam no seu perfil!"
  }
]